Code/DataGeneration/openfoam/run/Channel_bifurcation/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    front
    {
        type            empty;
        physicalType    patch;
        nFaces          1638;
        startFace       2377;
    }
    back
    {
        type            empty;
        physicalType    patch;
        nFaces          1638;
        startFace       4015;
    }
    bottom
    {
        type            patch;
        physicalType    patch;
        nFaces          10;
        startFace       5653;
    }
    left
    {
        type            wall;
        physicalType    patch;
        nFaces          49;
        startFace       5663;
    }
    top
    {
        type            patch;
        physicalType    patch;
        nFaces          14;
        startFace       5712;
    }
    right
    {
        type            wall;
        physicalType    patch;
        nFaces          49;
        startFace       5726;
    }
    inner_arc
    {
        type            wall;
        physicalType    patch;
        nFaces          38;
        startFace       5775;
    }
)

// ************************************************************************* //
